dataframes

In [40]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [41]:
np.random
randn(2,2)

array([[-0.13190614, -1.33509173],
       [-0.08929844,  0.6985664 ]])

In [43]:
df= pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [44]:
df

          W         X         Y         Z
A -0.975349 -1.054851  2.165421 -1.267240
B -0.802843 -0.253479  0.090699  1.321715
C  0.794129  1.359712  0.771970  0.294217
D -1.391519  0.147486 -0.729466 -0.720110
E -0.285257  2.090539  1.004056  1.031916

In [48]:
df['Z']#CLMN ACCESSING

A   -1.267240
B    1.321715
C    0.294217
D   -0.720110
E    1.031916
Name: Z, dtype: float64

In [49]:
df[['X','Y']]

          X         Y
A -1.054851  2.165421
B -0.253479  0.090699
C  1.359712  0.771970
D  0.147486 -0.729466
E  2.090539  1.004056

In [50]:
df[['X','Z']]

          X         Z
A -1.054851 -1.267240
B -0.253479  1.321715
C  1.359712  0.294217
D  0.147486 -0.720110
E  2.090539  1.031916

In [53]:
type(df['W'])

pandas.core.series.Series

In [55]:
df.Z

A   -1.267240
B    1.321715
C    0.294217
D   -0.720110
E    1.031916
Name: Z, dtype: float64

RAW ACCESSING

In [61]:
df.loc[['B']]

          W         X         Y         Z
B -0.802843 -0.253479  0.090699  1.321715

In [60]:
df.loc[['B','C']]

          W         X         Y         Z
B -0.802843 -0.253479  0.090699  1.321715
C  0.794129  1.359712  0.771970  0.294217

In [63]:
df.iloc[['1']]#instead of loc using iloc with indexno.

          W         X         Y         Z
B -0.802843 -0.253479  0.090699  1.321715

In [67]:
df['new']=df['Z']+10#to add new clmn

In [68]:
df

          W         X         Y         Z        new
A -0.975349 -1.054851  2.165421 -1.267240   8.732760
B -0.802843 -0.253479  0.090699  1.321715  11.321715
C  0.794129  1.359712  0.771970  0.294217  10.294217
D -1.391519  0.147486 -0.729466 -0.720110   9.279890
E -0.285257  2.090539  1.004056  1.031916  11.031916

In [77]:
df.drop('new',axis=1,inplace=True) #drop= to remove

In [78]:
df

          W         X         Y         Z
A -0.975349 -1.054851  2.165421 -1.267240
B -0.802843 -0.253479  0.090699  1.321715
C  0.794129  1.359712  0.771970  0.294217
D -1.391519  0.147486 -0.729466 -0.720110
E -0.285257  2.090539  1.004056  1.031916

In [85]:
df.drop('A',axis=0,inplace=True)

KeyError: "['A'] not found in axis"

In [86]:
df#now rawA COPLETELY removed bcs of'inplace=True

          W         X         Y         Z
B -0.802843 -0.253479  0.090699  1.321715
C  0.794129  1.359712  0.771970  0.294217
D -1.391519  0.147486 -0.729466 -0.720110
E -0.285257  2.090539  1.004056  1.031916

conditional selection

In [96]:
df

          W         X         Y         Z
B -0.802843 -0.253479  0.090699  1.321715
C  0.794129  1.359712  0.771970  0.294217
D -1.391519  0.147486 -0.729466 -0.720110
E -0.285257  2.090539  1.004056  1.031916

In [97]:
df>0

       W      X      Y      Z
B  False  False   True   True
C   True   True   True   True
D  False   True  False  False
E  False   True   True   True

In [89]:
df[df>0]#false values are nan and true values are showing values

          W         X         Y         Z
B       NaN       NaN  0.090699  1.321715
C  0.794129  1.359712  0.771970  0.294217
D       NaN  0.147486       NaN       NaN
E       NaN  2.090539  1.004056  1.031916

In [90]:
df[df['W']>0]

          W         X        Y         Z
C  0.794129  1.359712  0.77197  0.294217

In [92]:
df[df['W']>0]['Y']

C    0.77197
Name: Y, dtype: float64

In [93]:
df[df['W']>0][['Y','X']]

         Y         X
C  0.77197  1.359712

In [94]:
df[(df['W']>0) & (df['Y'] > 0)]

          W         X        Y         Z
C  0.794129  1.359712  0.77197  0.294217

In [100]:
df

          W         X         Y         Z
B -0.802843 -0.253479  0.090699  1.321715
C  0.794129  1.359712  0.771970  0.294217
D -1.391519  0.147486 -0.729466 -0.720110
E -0.285257  2.090539  1.004056  1.031916

In [102]:
df>1

       W      X      Y      Z
B  False  False  False   True
C  False   True  False  False
D  False  False  False  False
E  False   True   True   True

In [106]:
df[df['X']>1]#SELECTD CLMN RAWS ALSO PRINTED HERE

          W         X         Y         Z
C  0.794129  1.359712  0.771970  0.294217
E -0.285257  2.090539  1.004056  1.031916

In [104]:
df[df['X']>1][['W']]#W FOR SELECT ONLY CLMN

          W
C  0.794129
E -0.285257

In [108]:
df

          W         X         Y         Z
B -0.802843 -0.253479  0.090699  1.321715
C  0.794129  1.359712  0.771970  0.294217
D -1.391519  0.147486 -0.729466 -0.720110
E -0.285257  2.090539  1.004056  1.031916